Retrieves the start extension path.
  Namespace:   Autodesk.Revit.DB.Architecture
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public IList<Curve> GetStartExtensionPath()
  Visual Basic
Public Function GetStartExtensionPath As IList(Of Curve)
  Visual C++
public:
IList<Curve^>^ GetStartExtensionPath()
 Return Value
 The start extension path of the rail.
 See Also
  ContinuousRail Class
  Autodesk.Revit.DB.Architecture Namespace